// Вывести квадрат числа
Console.WriteLine("Найти квадрат числа ");
Console.WriteLine("Введите число ");
double numberA = Convert.ToDouble(Console.ReadLine());
double result = numberA * numberA;
Console.Write("Итог: ");
Console.WriteLine(result);